# coding:utf-8

# 用于生成所有老师名字的list，之后将其序列化，保存在本地
import pickle
# 副教授
name_of_teacher_1 = ['何玉辉','何虎','冯佩','刘厚根','刘峙林','刘春辉','刘景琳','吴旺青','吴波','周亚军','崔晓辉','张星星','戴瑜',
                    '朱桂华','李松柏','李毅波','李群明','柳波','樊广军','汤晓燕','王刚','王聪','王青山','申儒林','石琛','罗春雷',
                    '罗筱英','胡友旺','胡小舟','胡琼','谢习华','谢敬华','贺继林','赵宏强','郑煜','钟国梁','陈思雨','陈明松','韩奉林',
                    '黄始全','龚海']

# 教授
name_of_teacher_2 = ['严宏志','云忠','何竞飞','傅志红','刘义伦','刘少军','刘德福','吴万荣','吴运新','周海波','唐华平','唐进元','喻海良',
                    '夏建芳','夏益敏','孙小燕','帅词俊','廖平','张怀亮','张立华','徐海良','易幼平','朱建新','朱文辉','李军辉','李力',
                    '李建军','李建平','李新和','李晓谦','李涵雄','李艳','杨忠炯','杨放琼','欧阳鸿武','段吉安','汪炼成','湛利华','王恒升',
                    '王福亮','王艾伦','翁灿','胡仕成','胡军科','胡均平','蒋炳炎','蔺永诚','谭建平','谭青','贺地求','赵海鸣','邓华','邓圭玲',
                    '钟掘','陆新江','韩雷','黄元春','黄志辉','黄明辉','黄长清']
# 讲师
name_of_teacher_3 = ['周亮','周元生','李向华','王彦','赵兴','邓积微','陈桌','陈志','魏文元','黄志雄']

name_of_teacher = name_of_teacher_1+name_of_teacher_2+name_of_teacher_3

f = open('teacher_name_list','wb')
pickle.dump(name_of_teacher,f)
f.close()

